[
    {
        "Title": "البنية السياسية للدولة المصرية",
        "Context": "كما جاء في دستورها الجديد (2014)، جمهورية مصر العربية دولة ذات سيادة، موحدة لا تقبل التجزئة، ولا ينزل عن شيء منها، نظامها ديمقراطي يقوم على أساس مواطنة وسيادة القانون. يقوم النظام السياسي على تعدد الأحزاب والتداول السلمي للسلطة، والفصل بين السلطات والتوازن بينها، رئيس الجمهورية هو رئيس الدولة، ورئيس السلطة التنفيذية، ويشرف على أعمال الحكومة وعرض برنامجه على مجلس النواب الذي يقر السياسة العامة للدولة، والخطة العامة للتنمية الاقتصادية، والاجتماعية، والموازنة العامة للدولة، ويمارس الرقابة على أعمال السلطة التنفيذية."
    },
    {
        "Title": "النظام الاقتصادي للدولة المصرية",
        "Context": "بدأ الاقتصاد المصري معتمدا على الزراعة بشهرة بعض المحاصيل كالقطن والفواكه ثم تطور الصناعات مع النظام الاشتراكي وتجلت السياحة من أهم مصادر الاقتصاد زيادة على تعدد الثروات الطبيعية مثل النفط والغاز الطبيعي وعائدات قناة السويس كممر ملاحي عالمي بجانب نشاطات الإعلام وفي الفترة الأخيرة، اتجه الاقتصاد نحو الاقتصاد الحر وزيادة الاستثمارات. يعتبر الاقتصاد المصري الثاني في الدول العربية بعد المملكة العربية السعودية والثاني إفريقيا بعد جنوب إفريقيا. العملة: الجنيه المصري"
    },
    {
        "Title": "السياق العام لمصر",
        "Context": "العاصمة: القاهرة. عدد السكان: 96,521,618. اللغة الرسمية: العربية. المساحة الجغرافية: تقع جمهورية مصر العربية في الشمال الشرقي لقارة إفريقيا، وتطل على كل من الساحل الجنوبي الشرقي للبحر المتوسط والساحل الشمالي الغربي للبحر الأحمر. تشكل شبه جزيرة سيناء جزءاً من الأراضي المصرية، وتقع في قارة آسيا. لمصر حدود مشتركة مع ليبيا من الغرب، مع السودان من الجنوب، مع إسرائيل وفلسطين (قطاع غزة) من الشمال الشرقي، ويمر الممر المائي (قناة السويس) الذي يربط البحر المتوسط والبحر الأحمر عبر الأراضي المصرية. تشكل الصحراء غالبية مساحة مصر، ويتركز أغلب سكان الجمهورية في وادي النيل والدلتا."
    },
    {
        "Title": "مؤشرات التنمية الاقتصادية في مصر",
        "Context": "الناتج المحلي الإجمالي المصري عن عام 2014/2013 بسعر السوق = 1643.4 مليار جنيه مصري. معدل النمو السنوي للناتج المحلي الإجمالي عام 2014 = 2.1% والتضخم عام 2014 = 10.1%"
    },
    {
        "Title": "الدستور المصري والمساواة وعدم التمييز",
        "Context": "ساوى القانون الأساسي للبلاد (الدستور المصري) بين الرجل والمرأة فقد أشارت ديباجته إلى المساواة كمبدأ حاكم لكل نصوصه ونصت على أن الدستور يفتح آفاقاً طريق المستقبل، ويتسق مع الإعلان العالمي لحقوق الإنسان الذي شاركنا في صياغته، ووافقنا عليه. والنص السابق هو نص حاكم لكل مواد الدستور حيث أن الحقوق السياسية والاجتماعية والاقتصادية للمرأة المصرية تجد أصلها في الإعلان العالمي لحقوق الإنسان والاتفاقيات الدولية المنبثقة منه كالعهد الدولي للحقوق السياسية والمدنية والعهد الدولي للحقوق الاقتصادية الاجتماعية والثقافية وغيرها من الاتفاقات. والتزام القانون بحقوق المرأة المقررة في الاتفاقيات الدولية السابقة وغيرها من الاتفاقيات أكده الدستور بإشارته إلى أن تلتزم الدولة بالاتفاقيات والعهود والمواثيق الدولية لحقوق الإنسان التي تصدق عليها مصر، وتصبح لها قوة القانون بعد نشرها وفقاً للأوضاع المقررة."
    },
    {
        "Title": "النظام التعليمي في مصر",
        "Context": "يتبع النظام التعليمي في مصر نظام التعليم المجاني الإلزامي لمدة 12 سنة، ويتكون من ثلاث مراحل: الابتدائية (6 سنوات)، الإعدادية (3 سنوات)، الثانوية (3 سنوات). توجد أيضًا جامعات حكومية وخاصة تقدم التعليم العالي في مختلف التخصصات."
    },
    {
        "Title": "السياحة في مصر",
        "Context": "تعتبر مصر من أهم الوجهات السياحية العالمية بسبب آثارها الفرعونية والإسلامية والقبطية، وشواطئها على البحر الأحمر والبحر المتوسط، بالإضافة إلى السياحة العلاجية والترفيهية."
    },
    {
        "Title": "الثقافة المصرية",
        "Context": "تمتلك مصر تراثًا ثقافيًا غنيًا يشمل الأدب، الموسيقى، السينما، المسرح، والفنون التشكيلية. تعتبر القاهرة مركزًا ثقافيًا مهمًا في العالم العربي."
    },
    {
        "Title": "الصحة في مصر",
        "Context": "يوجد في مصر نظام صحي يتكون من مستشفيات حكومية وخاصة، وتوفر الدولة الرعاية الصحية المجانية للمواطنين، مع وجود برامج للتأمين الصحي."
    },
    {
        "Title": "البنية التحتية في مصر",
        "Context": "تشمل البنية التحتية في مصر شبكة طرق ومطارات وموانئ متطورة، بالإضافة إلى شبكات اتصالات وطاقة حديثة، مع مشروعات كبرى مثل العاصمة الإدارية الجديدة."
    }
]